kidzen/app/controllers/groups_controller.rb

  def show
    @group = Group.where(:id=>params[:id]).first
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    if signed_in?
      @group = Group.new(group_params)
      @group.owner = current_user.username
      if !@group.valid?
        flash[:error] = @group.errors.full_messages.join("<br>").html_safe
      end
      respond_to do |format|
        if @group.save
---
INSERT INTO "groups" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Thu, 27 Mar 2014 00:24:16 UTC +00:00], ["updated_at", Thu, 27 Mar 2014 00:24:16 UTC +00:00]]

  def destroy
    @group = Group.find(params[:id]).destroy
---
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "1"]]