kidzen/app/views/groups/index.html.erb

      <tr>
        <td><%= link_to group.group_name, group %></td>
---
SELECT "groups".* FROM "groups"